<?php
namespace app\common\model;
use think\Model;
/**
 * Class Errors
 * @package app\common\model
 * @author wanghaiyang
 *
 */
/**
 * Created by PhpStorm.
 * User: wanghaiyang
 * Date: 2018/10/9
 * Time: 10:01
 */
class Error extends Model
{

    /**
     * 错误返回代码
     */
    const ERRORCODE = array(
//        公用错误代码集合
        0 => 'SUCCESS',
        10001 => '查询结果为空',
        10002 => '参数必须为数组',
        10003 => '账号密码错误！',
        10004 => '账号密码不能为空！',
        10005 => '参数必须存在！',
        10006 => '验证码错误！',

//        策略错误代码集合
        20001 => '添加产品数据失败！',
        20002 => '产品名称不能为空！',
        20003 => '产品id不能为空！',
        20004 => '没有找到该id下的产品信息！',
        20005 => '没有提交修改参数！',
        20006 => 'id不能为空！',
        20007 => '修改产品失败！',
        20008 => '您的修改无效！',
        20009 => '删除失败！',
        20010 => '该产品名称已经存在！',
        20011 => '未删除任何规则！',
//        规则错误代码集合
        30001 => '添加参数不能为空',
        30002 => '添加规则数据失败',
        30004 => '没有找到该id下的规则信息！',
        30003 => '规则id不能为空！',
        30005 => '规则名字已存在!',
        30006 => '子规则名字已存在!',
        30007 => '未删除任何子规则！',
//        服务器管理错误代码集合

        40001 => '服务器配置参数不能为空',
        40002 => '添加服务器配置数据失败',
        40003 => '没有找到该id下的服务器信息',
        40003 => '服务器id不能为空',
        40004 => '删除服务器失败！修改无效！',
        40005 => '服务器名称已经存在！',
        40006 => '服务器状态更新无效！',
        40007 => '服务器状态均正常！',
        40008 => '服务器未开启过！',
        40009 => '服务器时间更新成功！',
        40010 => '服务器请求失败，注意携带修改参数',
        40011 => '服务器请求失败，修改参数无效',
        40012 => '检查服务器ID和操作码需同时存在！',

//        邦定服务器产品错误提示
        50001 => '添加邦定记录失败！',
        50002 => '添加绑定参数无效！',
        50003 => '绑定ID不能为空！',
        50004 => '绑定的产品id不能为空！',
        50005 => '绑定的服务器id不能为空！',
        50006 => '添加邦定规则记录失败！',
        50007 => '解绑记录失败！',
        50008 => '解绑ID不能为空！',
        50009 => '绑定的规则id不能为空！',
        50010 => '解绑ID不能为空！',
        50011 => '批量添加绑定自规则失败！',
        50012 => '绑定规则失败！',
        50013 => '子定规则推文不能为空！',
        50014 => '子定规则URl不能为空！',
        50015 => '子定规则ID不能为空！',
        50016 => '更新子规则绑定内容失败！',
        50017 => '已添加之间的绑定记录，请刷新查看！',
        50018 => '修改绑定子规则信息无效！',
        50019 => '子规则已经绑定！',
//        黑名单
        60001 => '添加记录失败！[黑名单记录]',
        60002 => '记录获取有误！[黑名单记录]',
        60003 => '无效的修改！[黑名单记录]',
        60005 => '无效的删除！[黑名单记录]',
        60006 => '添加记录失败！[白名单记录]',
        60007 => '记录获取有误！[白名单记录]',
        60008 => '无效的修改！[白名单记录]',
        60009 => '无效的删除！[白名单记录]',
//        服务器统计报错代码
        70001 => '查询结果为空！[服务器统计]',
//        统计错误返回代码
        80001 => '查询的时间必须存在[产品统计]',
        80002 => '查询的统计结果为空[产品统计]',

//        从数据库报错
        90001 => '无数据表![信息采集数据库]',
        90002 => '数据表名必须存在![信息采集数据库]',
        90003 => '数据表无数据![信息采集数据库]',
        90004 => '删除表失败！[信息采集数据库]',
        90005 => '没有对应的数据表！[信息采集数据库]',
//        策略推送

        11001 => '添加记录失败！[策略推送]',
        11002 => '无效的删除！[策略推送]',
        11003 => '无效的修改！[策略推送]',
        11004 => '记录获取有误！[策略推送]',
        11005 => '名称已存在！[策略推送]',
        11006 => '策略时间不能小于0！[策略推送]',
        11007 => '策略编号不能小于0！[策略推送]',
        11008 => '策略编号已存在！[策略推送]',
//       与服务器交互错误代码
        12001 => '执行命令失败！Execution order failed！',
        12002 => '解密文件失败！he decryption file failed!' ,
//        用户信息代码提示
        13001 => '查不到该用信息',
        13002 => '修改用户信息无效',
        13003 => '删除用户失败',
        13004 => '用户ID不能为空',
        13005 => '用户密码不能为空',
        13006 => '用户账号不能为空',
        13007 => '添加用户失败',
        13008 => '账号已经存在',
        13009 =>  '该账号没有分配菜单',

//        文件操作代码
        14001 => '文件不存在！',
        14002 => '检查文件路径以及文件！',
        14003 => '下载方法异常！',
//      用户连表
        15001 => '用户菜单关系建立失败！',

//        短链
        16001 => '添加记录失败！[短链管理]',
        16002 => '没有查到结果！[短链管理]',
        16003 => '删除失败！[短链管理]',
        16004 => '处理无效！[短链管理]',
        16005 => '添加异常链接出错！[短链管理]',
        16006 => '字符串拼接异常！[短链管理]',
        );
}